def 加法(a,b):
    return a+b
def 減法(a,b):
    return a-b
def 除法(a,b):
    商數=a//b
    餘數=a%b
    return 商數,餘數
def 乘法(a,b):
    return a*b
print(加法(1,2))
while True:
    計算類型=input("請輸入1(加法),2(減法),3(除法),4(乘法),任意鍵為結束:\n")
    if  計算類型   in ("1","2","3","4"):
        數字1=int(input("第一個數字:"))
        數字2=int(input("第二個數字:"))
        if 計算類型=="1":
            print(f"{數字1}加{數字2}等於{加法(數字1,數字2)}")
        elif 計算類型=="2":
            print(f"{數字1}減{數字2}等於{減法(數字1,數字2)}")
        elif 計算類型=="3":
            if 數字1%數字2==0:
                print(f"{數字1} 除以 {數字2} 等於 {除法(數字1,數字2)[0]} 餘 {除法(數字1,數字2)[1]}")
            else:
                print(f"{數字1} 除以 {數字2} 等於 {除法(數字1,數字2)[0]} 餘 {除法(數字1,數字2)[1]}")
        elif 計算類型=="4":
            print(f"{數字1} 乘 {數字2} 等於 {乘法(數字1,數字2)}")
    else:
        print("結束")
        break